wrk6/wrk_3003_w_Heavy.txt
wrk -t 3 -c 3 -d180 -R 50 -math 1 --latency http://13.0.0.29:8081/high/web730m.html
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.67m    48.36s    2.91m    60.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    93519.87 ms
 75.000%    141426.69 ms
 90.000%    155844.61 ms
 99.000%    174456.83 ms
 99.900%    174456.83 ms
 99.990%    174456.83 ms
 99.999%    174456.83 ms
100.000%    174456.83 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   22593.535     0.000000            1         1.00
   22593.535     0.100000            1         1.11
   37847.039     0.200000            2         1.25
   59310.079     0.300000            3         1.43
   76939.263     0.400000            4         1.67
   93519.871     0.500000            5         2.00
  113508.351     0.550000            6         2.22
  113508.351     0.600000            6         2.50
  127598.591     0.650000            7         2.86
  127598.591     0.700000            7         3.33
  141426.687     0.750000            8         4.00
  141426.687     0.775000            8         4.44
  141426.687     0.800000            8         5.00
  155844.607     0.825000            9         5.71
  155844.607     0.850000            9         6.67
  155844.607     0.875000            9         8.00
  155844.607     0.887500            9         8.89
  155844.607     0.900000            9        10.00
  174456.831     0.912500           10        11.43
  174456.831     1.000000           10          inf
#[Mean    =   100267.622, StdDeviation   =    48360.781]
#[Max     =   174325.760, Total count    =           10]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    13885.44 ms
 75.000%    18317.31 ms
 90.000%    18907.13 ms
 99.000%    22593.53 ms
 99.900%    22593.53 ms
 99.990%    22593.53 ms
 99.999%    22593.53 ms
100.000%    22593.53 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11517.951     0.000000            1         1.00
   11517.951     0.100000            1         1.11
   11681.791     0.200000            2         1.25
   11960.319     0.300000            3         1.43
   12623.871     0.400000            4         1.67
   13885.439     0.500000            5         2.00
   15007.743     0.550000            6         2.22
   15007.743     0.600000            6         2.50
   16859.135     0.650000            7         2.86
   16859.135     0.700000            7         3.33
   18317.311     0.750000            8         4.00
   18317.311     0.775000            8         4.44
   18317.311     0.800000            8         5.00
   18907.135     0.825000            9         5.71
   18907.135     0.850000            9         6.67
   18907.135     0.875000            9         8.00
   18907.135     0.887500            9         8.89
   18907.135     0.900000            9        10.00
   22593.535     0.912500           10        11.43
   22593.535     1.000000           10          inf
#[Mean    =    15329.690, StdDeviation   =     3541.199]
#[Max     =    22577.152, Total count    =           10]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10 requests in 3.02m, 7.37GB read
  Socket errors: connect 0, read 0, write 0, timeout 73
Requests/sec:      0.06
Transfer/sec:     41.61MB
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49m    46.77s    2.79m    63.64%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    87556.10 ms
 75.000%    118685.70 ms
 90.000%    146538.49 ms
 99.000%    167378.94 ms
 99.900%    167378.94 ms
 99.990%    167378.94 ms
 99.999%    167378.94 ms
100.000%    167378.94 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   16351.231     0.000000            1         1.00
   30867.455     0.100000            2         1.11
   45252.607     0.200000            3         1.25
   59899.903     0.300000            4         1.43
   74514.431     0.400000            5         1.67
   87556.095     0.500000            6         2.00
  101711.871     0.550000            7         2.22
  101711.871     0.600000            7         2.50
  118685.695     0.650000            8         2.86
  118685.695     0.700000            8         3.33
  133169.151     0.750000            9         4.00
  133169.151     0.775000            9         4.44
  133169.151     0.800000            9         5.00
  146538.495     0.825000           10         5.71
  146538.495     0.850000           10         6.67
  146538.495     0.875000           10         8.00
  146538.495     0.887500           10         8.89
  146538.495     0.900000           10        10.00
  167378.943     0.912500           11        11.43
  167378.943     1.000000           11          inf
#[Mean    =    89235.084, StdDeviation   =    46766.716]
#[Max     =   167247.872, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    11837.44 ms
 75.000%    11968.51 ms
 90.000%    16351.23 ms
 99.000%    18202.62 ms
 99.900%    18202.62 ms
 99.990%    18202.62 ms
 99.999%    18202.62 ms
100.000%    18202.62 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11362.303     0.000000            1         1.00
   11403.263     0.100000            2         1.11
   11493.375     0.200000            3         1.25
   11649.023     0.300000            4         1.43
   11714.559     0.400000            5         1.67
   11837.439     0.500000            6         2.00
   11845.631     0.550000            7         2.22
   11845.631     0.600000            7         2.50
   11968.511     0.650000            8         2.86
   11968.511     0.700000            8         3.33
   15310.847     0.750000            9         4.00
   15310.847     0.775000            9         4.44
   15310.847     0.800000            9         5.00
   16351.231     0.825000           10         5.71
   16351.231     0.850000           10         6.67
   16351.231     0.875000           10         8.00
   16351.231     0.887500           10         8.89
   16351.231     0.900000           10        10.00
   18202.623     0.912500           11        11.43
   18202.623     1.000000           11          inf
#[Mean    =    13008.151, StdDeviation   =     2302.586]
#[Max     =    18186.240, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12 requests in 3.03m, 8.54GB read
  Socket errors: connect 0, read 0, write 0, timeout 71
Requests/sec:      0.07
Transfer/sec:     48.04MB
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.65m     0.91m    2.99m    63.64%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    103612.41 ms
 75.000%    137494.53 ms
 90.000%    165675.01 ms
 99.000%    179568.64 ms
 99.900%    179568.64 ms
 99.990%    179568.64 ms
 99.999%    179568.64 ms
100.000%    179568.64 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11796.479     0.000000            1         1.00
   25919.487     0.100000            2         1.11
   47939.583     0.200000            3         1.25
   62324.735     0.300000            4         1.43
   80674.815     0.400000            5         1.67
  103612.415     0.500000            6         2.00
  124321.791     0.550000            7         2.22
  124321.791     0.600000            7         2.50
  137494.527     0.650000            8         2.86
  137494.527     0.700000            8         3.33
  151650.303     0.750000            9         4.00
  151650.303     0.775000            9         4.44
  151650.303     0.800000            9         5.00
  165675.007     0.825000           10         5.71
  165675.007     0.850000           10         6.67
  165675.007     0.875000           10         8.00
  165675.007     0.887500           10         8.89
  165675.007     0.900000           10        10.00
  179568.639     0.912500           11        11.43
  179568.639     1.000000           11          inf
#[Mean    =    99142.935, StdDeviation   =    54821.245]
#[Max     =   179437.568, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    11804.67 ms
 75.000%    15745.02 ms
 90.000%    19447.81 ms
 99.000%    21200.90 ms
 99.900%    21200.90 ms
 99.990%    21200.90 ms
 99.999%    21200.90 ms
100.000%    21200.90 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11100.159     0.000000            1         1.00
   11550.719     0.100000            2         1.11
   11575.295     0.200000            3         1.25
   11689.983     0.300000            4         1.43
   11796.479     0.400000            5         1.67
   11804.671     0.500000            6         2.00
   12369.919     0.550000            7         2.22
   12369.919     0.600000            7         2.50
   15745.023     0.650000            8         2.86
   15745.023     0.700000            8         3.33
   18137.087     0.750000            9         4.00
   18137.087     0.775000            9         4.44
   18137.087     0.800000            9         5.00
   19447.807     0.825000           10         5.71
   19447.807     0.850000           10         6.67
   19447.807     0.875000           10         8.00
   19447.807     0.887500           10         8.89
   19447.807     0.900000           10        10.00
   21200.895     0.912500           11        11.43
   21200.895     1.000000           11          inf
#[Mean    =    14214.609, StdDeviation   =     3554.562]
#[Max     =    21184.512, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11 requests in 3.02m, 7.83GB read
  Socket errors: connect 0, read 0, write 0, timeout 72
Requests/sec:      0.06
Transfer/sec:     44.19MB